<?php
// +----------------------------------------------------------------------
// | Created by PHPstorm: 百度网盘管理 [ 百度网盘管理 ] 
// +----------------------------------------------------------------------
// | Copyright (c) 2023 [xunmzy] All rights reserved.
// +----------------------------------------------------------------------
// | SiteUrl: https://www.seekxm.com
// +----------------------------------------------------------------------
// | Author: 寻梦资源网 <seekxm@qq.com>
// +----------------------------------------------------------------------
// | Date: 2023/4/8-3:39
// +----------------------------------------------------------------------
// | Description:  
// +----------------------------------------------------------------------

return [
    'auth_on'           => true,                      // 认证开关
    'auth_type'         => 2,                         // 认证方式，1为实时认证；2为登录认证。
    'auth_group'        => 'auth_group',        // 用户组数据表名
    'auth_group_access' => 'auth_group_access', // 用户-用户组关系表
    'auth_rule'         => 'auth_rule',         // 权限规则表
    'auth_user'         => 'auth_admin',            // 用户信息表
    'auth_white_list'   => [          // auth白名单不会验证规则
        'index/index','index/home','index/logout','bdauth/addbdauthtoken','bdauthinfo/index','admin/bdlist'
    ]
];